{ "_id" : { "$oid" : "58f9762c9467d2007e4c7567" }, "date" : "2016-10-22", "source" : "NYT", "url" : "http://www.nytimes.com/2016/10/23/fashion/weddings/tracy-hamilton-and-john-bustamante-married.html?ref=todayspaper", "content" : { "12" : "Mr. Bustamante eventually lost the election, and Ms. Hamilton, who was raising her then 6-year-old daughter, Nola Grace, left the newspaper soon after to take a job at a local utility company.", "24" : "When their conversation finally ended, Ms. Hamilton was at a loss for words.", "2" : "Ms. Hamilton, 47, will continue to use her name professionally. She is the chief blog editor at Rackspace, a technology services company in San Antonio. She graduated from Mills College in Oakland, Calif., and received a master¡¦s in journalism from Columbia.", "4" : "The bride¡¦s father is a retired United States Navy captain who was last stationed at United States Fleet Activities Sasebo, a naval base on the Japanese island of Kyushu. Her mother retired as a registered nurse at Long Beach Memorial Hospital in Long Beach, Calif. The bride is also a stepdaughter of Elizabeth Cowan.", "16" : "One of those reporters was Ms. Hamilton, whom he asked out to lunch via Twitter even after learning that she was no longer a member of the press.", "23" : "¡§I always had to carry conversations in past relationships, but this was different,¡¨ he said. ¡§She had a lot to say.¡¨", "25" : "¡§I went back to my office after lunch and thought to myself, ¡¥Holy cow, what just happened?¡¦¡¨ she said.", "7" : "Ms. Hamilton and Mr. Bustamante met over the telephone in the spring of 2012. At the time, he was running for the congressional seat his father used to occupy, and she was a political reporter with The San Antonio Express-News who had called for an interview.", "15" : "¡§My father had a tempestuous relationship with the press, and I was looking to improve on that,¡¨ said Mr. Bustamante, whose father was convicted of accepting bribes and racketeering in 1993. ¡§So I contacted about four reporters I had dealt with in the past just to kind of put my own thoughts out there as to why I was seeking a judgeship.¡¨", "20" : "¡§We had a wonderful nonstop conversation,¡¨ Ms. Hamilton said. ¡§He was not only handsome, but he was also a great listener. I was immediately smitten.¡¨", "10" : "Despite the aggressive line of questioning, Mr. Bustamante did not get flustered. Instead, he became a bit intrigued.", "1" : "Tracy Idell Hamilton and John Marcus Bustamante were married Oct. 22 at the Little Church of La Villita in San Antonio. The Rev. Arthur Flores, a Baptist minister, performed a nondenominational ceremony.", "5" : "Mr. Bustamante, 40, is a partner in Denko & Bustamante, a law firm in Austin, Tex. He graduated from the Massachusetts Institute of Technology and received a law degree from the University of Texas.", "18" : "She accepted his invitation, under one condition: ¡§I told him that I would go as long as he didn¡¦t ask me for a donation.¡¨", "11" : "¡§When you run for office, you always run into a skeptical press, and she was taking that skepticism to another level,¡¨ he said. ¡§But I thought she was very intelligent, and I began looking up her byline and her Twitter profile to try and get an idea as to what kind of writer she was, and what she looked like.¡¨", "19" : "They met at a Mexican restaurant in San Antonio, where she told him all about ¡§the horrors of internet dating,¡¨ as she put it.", "17" : "¡§I figured that any good political reporter would have an excellent list of contacts that I could reach out to for support,¡¨ he said.", "13" : "¡§I had interviewed him a few more times before he lost,¡¨ Ms. Hamilton said. ¡§And then I didn¡¦t think about him anymore.¡¨", "8" : "¡§I was pretty hard on him,¡¨ Ms. Hamilton said. ¡§I asked why should a 35-year-old like himself, who had never even run for a lower office, be entrusted with a congressional seat.¡¨", "9" : "¡§I found him to be arrogant,¡¨ she said, ¡§but he was also very bright and pretty unflappable.¡¨", "22" : "¡§She was so intelligent and strong-willed,¡¨ said Mr. Bustamante, who won the Democratic primary before losing in the general election in November 2014.", "14" : "But in September 2013, Mr. Bustamante resurfaced. This time he had decided to run for district judge in Bexar County.", "21" : "Mr. Bustamante, who had recently ended a relationship, liked what he was hearing.", "3" : "She is a daughter of Rebecca Chadwick of Costa Mesa, Calif., and John Daniel Miller Hamilton IV of Sasebo, Japan.", "6" : "He is a son of Rebecca P. Bustamante and Albert G. Bustamante of San Antonio. His mother retired as a lawyer in San Antonio. His father, now retired, was the congressman from the 23rd District in southwestern Texas from 1985 to 1993, and was the county judge of Bexar County, Tex., from 1978 to 1984." }, "title" : "Tracy Hamilton and John Bustamante: The Voters Said No. She Said Yes." }